//================================================================================
//	アイテムクラス
//	Author:Tsukagoshi Toshiyuki
//================================================================================

//================================================================================
//	include
//================================================================================
#include "Item.h"
#include "Texture.h"
#include "Collision.h"

//================================================================================
//	静的メンバ
//================================================================================
List<Item> Item::_ItemList;

const D3DXVECTOR2 DEFAULT_ITEM_SIZE = D3DXVECTOR2(84.0f,84.0f);//アイテムのデフォルトサイズ(いーたんが128x128の時)

//================================================================================
//	アイテムテーブル
//================================================================================
const float Item::ItemScore[ITEM_ID_MAX] = {
	10.0f,			//うさぎ
	10.0f,			//ねこ
	10.0f,			//くま
};

//================================================================================
//	生成
//================================================================================
Item* Item::Create(const D3DXVECTOR3 &pos, const D3DXVECTOR2 &size, const D3DXCOLOR &color, const int &id, int priority)
{
	Item* item = new Item(priority);
	item->SetPos(pos);
	item->SetSize(D3DXVECTOR3(size.x, size.y, 0));
	item->SetColor(color);

	item->SetID(id);
	item->SetTexture(GetTexture(TEX((int)TEX_ITEM_OFFSET + id)));
	item->SetScore(ItemScore[id]);

	return item;
}

//================================================================================
//	コンストラクタ
//================================================================================
Item::Item(int priority) :Sprite(priority)
{
	SelfIterator = nullptr;
	SelfIterator = _ItemList.Add(this);
}

//================================================================================
//	デストラクタ
//================================================================================
Item::~Item()
{
	_ItemList.Delete(SelfIterator);
	SelfIterator = nullptr;
}

//================================================================================
//	更新処理
//================================================================================
void Item::Update()
{
	Sprite::Update();
}

//================================================================================
//	当たり判定
//	アイテムにあたっていたら当たっているアイテムのポインターを返す
//	あたっていなかったらヌルポインターを返す
//================================================================================
Item* Item::HitCheck(const D3DXVECTOR3& Pos, const D3DXVECTOR3& Size)
{
	VALUE<Item>* itr = _ItemList.Begin();

	while (itr)
	{
		if (Collision::Circle(Pos, Size.x*0.5f, itr->Data->_Pos, itr->Data->_Size.x*0.5f))
		{
			return itr->Data;
		}

		itr = itr->_Next;
	}

	return nullptr;
}