//=============================================================================
//数字クラス
//=============================================================================
//=============================================================================
//インクルード
//=============================================================================
#include "Number.h"

//=============================================================================
//生成
//=============================================================================
Number* Number::Create(D3DXVECTOR3 pos,D3DXVECTOR2 size,int num,int priority)
{
	Number* number = new Number(priority);
	if (number == nullptr)
	{
		return nullptr;
	}
	number->_Pos = pos;
	number->_Size = D3DXVECTOR3(size.x,size.y,0);
	number->_Color = D3DXCOLOR(1.0f,1.0f,1.0f,1.0f);
	number->SetUV(num,0,10,1);
	number->_Number = num;
	number->Texture = GetTexture(TEX_NUMBER);

	return number;
}

//=============================================================================
//数字を設定
//=============================================================================
void Number::SetNum(int num)
{
	_Number = num;
	SetUV(num,0,10,1);
}